## Midterm Exam
### Brandon Ownes and Loan Pham

### Q.1

In [132]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import string

In [133]:
# (a) Set random seed to be 50.

np.random.seed(50)
np.random.randn(50)

array([-1.56035211, -0.0309776 , -0.62092842, -1.46458049,  1.41194612,
       -0.47673214, -0.78046921,  1.07026774, -1.2822926 , -1.3274789 ,
        0.12633764,  0.86219372,  0.69673696, -0.33456518, -0.99752606,
        1.59890829,  3.31407535,  0.98777046,  0.12386626,  0.74278539,
       -0.39395585,  0.14811582, -0.41223445, -0.16071506,  0.13953147,
        0.28546937, -0.28126199,  1.71090732, -0.14976664,  0.69030672,
        1.09520951,  1.3384087 , -1.36898167,  0.48642763,  0.75352168,
        0.36346459, -0.31471048,  1.37328117, -0.62441716,  0.375754  ,
       -0.20041632,  0.74303806,  0.85736196, -1.50618929, -1.66635217,
       -0.2189948 , -0.35885843,  0.37852769,  0.68421537, -1.16785607])

In [134]:
# (b) Create a dataframe with four columns of data:-Each column has 26 random integers between -5 and 28
#     -The name of the columns = ['i','ii','iii','iv']-Create an index column and the values are from “A” to “Z”
n = 26
ix = list(string.ascii_uppercase)
df = pd.DataFrame(dict(
    i =np.random.randint(-5, 28, size=n),
    ii =np.random.randint(-5, 28, size=n),
    iii = np.random.randint(-5, 28, size=n),
    iv = np.random.randint(-5, 28, size=n), index = ix))
df

     i  ii  iii  iv index
0   22  25   -1   6     A
1   23   9    6  21     B
2   26  21   14  27     C
3   10  17    9  18     D
4    0   1   -2  -2     E
5   -1  25   23  23     F
6   -1  26   -1   0     G
7   13   4   22  23     H
8   12  -5    2  -4     I
9   21  11    8  -2     J
10   3  21   16  -5     K
11   6  -1   23   7     L
12  22  -4   16   7     M
13  22   8    9  27     N
14   2   9    8  16     O
15  -4  -3    1   9     P
16   3  17    7  14     Q
17  -2  -5   -5  11     R
18  16   9   -5  14     S
19  -2  25    3  27     T
20   1  21   27  -1     U
21  10  -1    9  10     V
22  26  11   -1  13     W
23  17  24   27  26     X
24  -5   9    2  17     Y
25   6  17   20  -3     Z

In [135]:
# (c) access the values in rows from “G” to “Q” and columns from “ii” to “iv”.

df.iloc[6:17, 2:5]

    iii  iv index
6    -1   0     G
7    22  23     H
8     2  -4     I
9     8  -2     J
10   16  -5     K
11   23   7     L
12   16   7     M
13    9  27     N
14    8  16     O
15    1   9     P
16    7  14     Q

In [136]:
# (d) Replace the negative values of “iii” with 0.

num = df["iii"]
print(np.where(num < 0, 0, num))

[ 0  6 14  9  0 23  0 22  2  8 16 23 16  9  8  1  7  0  0  3 27  9  0 27
  2 20]

In [137]:
# (e) If “iv” < 0, replace the values of “i” with 20.
df.loc[df['iv'] <= 0,'i'] = 20
display(df)

     i  ii  iii  iv index
0   22  25   -1   6     A
1   23   9    6  21     B
2   26  21   14  27     C
3   10  17    9  18     D
4   20   1   -2  -2     E
5   -1  25   23  23     F
6   20  26   -1   0     G
7   13   4   22  23     H
8   20  -5    2  -4     I
9   20  11    8  -2     J
10  20  21   16  -5     K
11   6  -1   23   7     L
12  22  -4   16   7     M
13  22   8    9  27     N
14   2   9    8  16     O
15  -4  -3    1   9     P
16   3  17    7  14     Q
17  -2  -5   -5  11     R
18  16   9   -5  14     S
19  -2  25    3  27     T
20  20  21   27  -1     U
21  10  -1    9  10     V
22  26  11   -1  13     W
23  17  24   27  26     X
24  -5   9    2  17     Y
25  20  17   20  -3     Z

In [138]:
# (f)  Create a list of unique values of “iv” 

list(df['iv'].unique())

[6, 21, 27, 18, -2, 23, 0, -4, -5, 7, 16, 9, 14, 11, -1, 10, 13, 26, 17, -3]

In [139]:
# (g) For all values greater than 0 in column “i”, find the mean.

col_i = df[df["i"]>0].mean()
col_i.loc["i"]

17.047619047619047

In [140]:
# (h) Drop all the rows with “ii” > 25.
df.dropna()
df.drop(df[df['ii'] > 25].index, inplace=True)
display(df)

     i  ii  iii  iv index
0   22  25   -1   6     A
1   23   9    6  21     B
2   26  21   14  27     C
3   10  17    9  18     D
4   20   1   -2  -2     E
5   -1  25   23  23     F
7   13   4   22  23     H
8   20  -5    2  -4     I
9   20  11    8  -2     J
10  20  21   16  -5     K
11   6  -1   23   7     L
12  22  -4   16   7     M
13  22   8    9  27     N
14   2   9    8  16     O
15  -4  -3    1   9     P
16   3  17    7  14     Q
17  -2  -5   -5  11     R
18  16   9   -5  14     S
19  -2  25    3  27     T
20  20  21   27  -1     U
21  10  -1    9  10     V
22  26  11   -1  13     W
23  17  24   27  26     X
24  -5   9    2  17     Y
25  20  17   20  -3     Z

## Q.2

In [141]:
# (a) Read in “Education.csv”. 
edu = income_data = pd.read_csv("../dataFiles/Education.csv")
edu

,Unnamed: 0,Region/Country/Area,Year,Data,Enrollments (Thousands)
0,0,"Total, all countries or areas",2005,Students enrolled in primary education (thousa...,"678,990"
1,1,"Total, all countries or areas",2005,Gross enrollement ratio - Primary (male),104.8
2,2,"Total, all countries or areas",2005,Gross enrollment ratio - Primary (female),99.8
3,3,"Total, all countries or areas",2005,Students enrolled in secondary education (thou...,"509,100"
4,4,"Total, all countries or areas",2005,Gross enrollment ratio - Secondary (male),65.7
...,...,...,...,...,...
8157,8157,Zimbabwe,2013,Gross enrollment ratio - Tertiary (male),6.5
8158,8158,Zimbabwe,2013,Gross enrollment ratio - Tertiary (female),5.5
8159,8159,Zimbabwe,2015,Students enrolled in tertiary education (thous...,136
8160,8160,Zimbabwe,2015,Gross enrollment ratio - Tertiary (male),8.9
8161,8161,Zimbabwe,2015,Gross enrollment ratio - Tertiary (female),8.0

In [142]:
# (b) The data of the column “Enrollments (Thousands)” are not numbers, convert them into numbers by removing the “,”.
edu["Enrollments (Thousands)"].replace(',','',regex=True,inplace=True)
display(edu)

,Unnamed: 0,Region/Country/Area,Year,Data,Enrollments (Thousands)
0,0,"Total, all countries or areas",2005,Students enrolled in primary education (thousa...,678990
1,1,"Total, all countries or areas",2005,Gross enrollement ratio - Primary (male),104.8
2,2,"Total, all countries or areas",2005,Gross enrollment ratio - Primary (female),99.8
3,3,"Total, all countries or areas",2005,Students enrolled in secondary education (thou...,509100
4,4,"Total, all countries or areas",2005,Gross enrollment ratio - Secondary (male),65.7
...,...,...,...,...,...
8157,8157,Zimbabwe,2013,Gross enrollment ratio - Tertiary (male),6.5
8158,8158,Zimbabwe,2013,Gross enrollment ratio - Tertiary (female),5.5
8159,8159,Zimbabwe,2015,Students enrolled in tertiary education (thous...,136
8160,8160,Zimbabwe,2015,Gross enrollment ratio - Tertiary (male),8.9
8161,8161,Zimbabwe,2015,Gross enrollment ratio - Tertiary (female),8.0

In [143]:
# (c) Find the unique values in the column “Data”, and then create a list.
list(edu["Data"].unique())

['Students enrolled in primary education (thousands)',
 'Gross enrollement ratio - Primary (male)',
 'Gross enrollment ratio - Primary (female)',
 'Students enrolled in secondary education (thousands)',
 'Gross enrollment ratio - Secondary (male)',
 'Gross enrollment ratio - Secondary (female)',
 'Students enrolled in tertiary education (thousands)',
 'Gross enrollment ratio - Tertiary (male)',
 'Gross enrollment ratio - Tertiary (female)']

In [144]:
# (d) Create a new dataframe, df2, of primary students’ enrollment in India by filtering and selecting from the original dataframe.-'Region/Country/Area' == “India”.-'Data' == “Students enrolled in primary education (thousands)”
df2=edu[['Region/Country/Area', 'Data']]
df2.rename(columns ={"India":'Region/Country/Area',"Students enrolled in primary education (thousands)":'Data'}, inplace=True)
df2

SyntaxError: invalid syntax (<ipython-input-144-f16b4ecdd7f4>, line 3)

In [96]:
# (e) From df2, create a series with index = “Year”, and values = “Enrollments (Thousands)”.

In [97]:
# (f)  Between “Year” = 2003 and “Year” = 2016, insert the missing years to the series. Fill the missing values of primary students’ enrollment with the average of the enrollment values.

## Q.3

In [98]:
#(a)  Use the file “university_towns.txt” to generate a dataframe. The dataframe contains the information of the of towns and the states they are in. Pay attention to the following when you process the file “university_towns.txt" The head of the dataframe should contain ["State","RegionName"]
#-read each line of the file, if the last six characters of the line are [edit], the line contains a State.-All the lines following the State are RegionName of that State until you come to another line with [edit].-For the line with RegionName, remove every character from “(“ to the end.

In [99]:
# (b)  Read in the file “City_Zhvi_AllHomes.csv”. The dataframe shows the mean housing values of each RegionName in each month starting from 1996-04 and ending in 2018-01

In [100]:
# (c)  Group by “State” and find the mean housing values in 2018-01

In [101]:
# (d)  Generate a series which shows the percentage change in housing price between 2000-01 and 2018-01 for each State and RegionName. Set State and RegionName as index. Arrange the series in descending order of values. [Some rows have the same RegionName but the States are different.]

In [102]:
# (e)  The current dataframe shows the housing values in each month. Convert it to show the housing value of each year for each RegionName. (the housing value of each year is obtained by averaging the monthly housing values.)

## Q.4

In [103]:
# (a)  Read in the file “gdplev.xlsx”  (It is an excel file, not csv file. You need to skip some rows.)

In [104]:
# (b)  Look at the column “GDP in billions of current dollars”. Find the year and the quarter that the recession starts.(A recession is defined as starting with two consecutive quarters of GDP decline)

In [105]:
# (c)  For the recession in part (c), find the year and the quarter that it ends. (Look at the column “GDP in billions of current dollars”. A recession is defined as ending with two consecutive quarters of GDP growth.)